## Plan Result (demo_pubsubappgateway - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * module.pubsubappgateway.azurerm_application_gateway.ag[0]
  * module.pubsubappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.pubsubappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.pubsubappgateway.azurerm_public_ip.app_gw[0]
  * module.pubsubappgateway.azurerm_web_application_firewall_policy.waf_policy[0]
* Delete
  * module.pubsubappgateway[0].azurerm_application_gateway.ag[0]
  * module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.pubsubappgateway[0].azurerm_public_ip.app_gw[0]
  * module.pubsubappgateway[0].azurerm_web_application_firewall_policy.waf_policy[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pubsubappgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + firewall_policy_id          = (known after apply)
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "cft-fe-demo-agw-pubsub"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "cft-demo-network-rg"
      + tags                        = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.100.50",
            ]
          + name         = "em-icp-webpubsub"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "em-icp-webpubsub"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "em-icp-webpubsub"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.50.98.8"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/infra-appgws"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/infra-appgws"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "em-icp-webpubsub.demo.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "em-icp-webpubsub"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + probe {
          + host                                      = "em-icp-webpubsub.demo.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "em-icp-webpubsub"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "em-icp-webpubsub"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "em-icp-webpubsub"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "em-icp-webpubsub"
          + id                          = (known after apply)
          + name                        = "em-icp-webpubsub"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "x_fwded_proto"

          + rewrite_rule {
              + name          = "x_fwded_proto"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-Proto"
                  + header_value = "https"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Port"
                  + header_value = "443"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_add_x_forwarded_for_proxy}"
                }
            }
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_policy (known after apply)
    }

  # module.pubsubappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "app-gw"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + log (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.pubsubappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "app-gw-storage-account"
      + storage_account_id             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Storage/storageAccounts/hmctscftdiagdemo"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "ApplicationGatewayAccessLog"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "ApplicationGatewayPerformanceLog"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)
    }

  # module.pubsubappgateway.azurerm_public_ip.app_gw[0] will be created
  + resource "azurerm_public_ip" "app_gw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-pubsub-fe-appgw-demo-pip"
      + resource_group_name     = "cft-demo-network-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.pubsubappgateway.azurerm_web_application_firewall_policy.waf_policy[0] will be created
  + resource "azurerm_web_application_firewall_policy" "waf_policy" {
      + http_listener_ids   = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "pubsub-waf-policy-demo"
      + path_based_rule_ids = (known after apply)
      + resource_group_name = "cft-demo-network-rg"
      + tags                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }

      + managed_rules {
          + managed_rule_set {
              + type    = "OWASP"
              + version = "3.2"

              + rule_group_override {
                  + disabled_rules  = (known after apply)
                  + rule_group_name = "REQUEST-920-PROTOCOL-ENFORCEMENT"

                  + rule {
                      + action  = "Log"
                      + enabled = true
                      + id      = "920300"
                    }
                  + rule {
                      + action  = "Block"
                      + enabled = true
                      + id      = "920440"
                    }
                }
            }
        }

      + policy_settings {
          + enabled                          = true
          + file_upload_limit_in_mb          = 100
          + max_request_body_size_in_kb      = 128
          + mode                             = "Prevention"
          + request_body_check               = true
          + request_body_inspect_limit_in_kb = 128
        }
    }

  # module.pubsubappgateway[0].azurerm_application_gateway.ag[0] will be destroyed
  # (because module.pubsubappgateway[0] is not in configuration)
  - resource "azurerm_application_gateway" "ag" {
      - enable_http2                      = false -> null
      - fips_enabled                      = false -> null
      - firewall_policy_id                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/pubsub-waf-policy-demo" -> null
      - force_firewall_policy_association = false -> null
      - id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub" -> null
      - location                          = "uksouth" -> null
      - name                              = "cft-fe-00-demo-agw-pubsub" -> null
      - private_endpoint_connection       = [] -> null
      - resource_group_name               = "cft-demo-network-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
          - "startupMode"  = "always"
        } -> null
      - zones                             = [
          - "1",
          - "2",
          - "3",
        ] -> null

      - autoscale_configuration {
          - max_capacity = 10 -> null
          - min_capacity = 2 -> null
        }

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/backendAddressPools/em-icp-webpubsub" -> null
          - ip_addresses = [
              - "10.50.100.50",
            ] -> null
          - name         = "em-icp-webpubsub" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/backendHttpSettingsCollection/em-icp-webpubsub" -> null
          - name                                = "em-icp-webpubsub" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/probes/em-icp-webpubsub" -> null
          - probe_name                          = "em-icp-webpubsub" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }

      - frontend_ip_configuration {
          - id                              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - name                            = "appGwPublicFrontendIp" -> null
          - private_ip_address_allocation   = "Dynamic" -> null
          - public_ip_address_id            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-pubsub-fe-appgw-demo-pip" -> null
            # (4 unchanged attributes hidden)
        }
      - frontend_ip_configuration {
          - id                              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - name                            = "appGwPrivateFrontendIp" -> null
          - private_ip_address              = "10.50.98.8" -> null
          - private_ip_address_allocation   = "Static" -> null
          - subnet_id                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/infra-appgws" -> null
            # (3 unchanged attributes hidden)
        }

      - frontend_port {
          - id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/frontendPorts/http" -> null
          - name = "http" -> null
          - port = 80 -> null
        }

      - gateway_ip_configuration {
          - id        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/gatewayIPConfigurations/gateway" -> null
          - name      = "gateway" -> null
          - subnet_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/infra-appgws" -> null
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "em-icp-webpubsub.demo.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/httpListeners/em-icp-webpubsub" -> null
          - name                           = "em-icp-webpubsub" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }

      - probe {
          - host                                      = "em-icp-webpubsub.demo.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/probes/em-icp-webpubsub" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "em-icp-webpubsub" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/backendAddressPools/em-icp-webpubsub" -> null
          - backend_address_pool_name   = "em-icp-webpubsub" -> null
          - backend_http_settings_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/backendHttpSettingsCollection/em-icp-webpubsub" -> null
          - backend_http_settings_name  = "em-icp-webpubsub" -> null
          - http_listener_id            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/httpListeners/em-icp-webpubsub" -> null
          - http_listener_name          = "em-icp-webpubsub" -> null
          - id                          = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/requestRoutingRules/em-icp-webpubsub" -> null
          - name                        = "em-icp-webpubsub" -> null
          - priority                    = 10 -> null
          - rewrite_rule_set_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }

      - rewrite_rule_set {
          - id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub/rewriteRuleSets/x_fwded_proto" -> null
          - name = "x_fwded_proto" -> null

          - rewrite_rule {
              - name          = "x_fwded_proto" -> null
              - rule_sequence = 100 -> null

              - request_header_configuration {
                  - header_name  = "X-Forwarded-Proto" -> null
                  - header_value = "https" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-Forwarded-Port" -> null
                  - header_value = "443" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-Forwarded-For" -> null
                  - header_value = "{var_add_x_forwarded_for_proxy}" -> null
                }
            }
        }

      - sku {
          - capacity = 0 -> null
          - name     = "WAF_v2" -> null
          - tier     = "WAF_v2" -> null
        }

      - ssl_policy {
          - cipher_suites        = [] -> null
          - disabled_protocols   = [] -> null
          - policy_name          = "AppGwSslPolicy20150501" -> null
          - policy_type          = "Predefined" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be destroyed
  # (because module.pubsubappgateway[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub|app-gw" -> null
      - log_analytics_destination_type = "AzureDiagnostics" -> null
      - log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
      - name                           = "app-gw" -> null
      - target_resource_id             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub" -> null
        # (2 unchanged attributes hidden)

      - log {
          - category       = "ApplicationGatewayAccessLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayFirewallLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayPerformanceLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be destroyed
  # (because module.pubsubappgateway[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
      - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub|app-gw-storage-account" -> null
      - log_analytics_destination_type = "AzureDiagnostics" -> null
      - name                           = "app-gw-storage-account" -> null
      - storage_account_id             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Storage/storageAccounts/hmctscftdiagdemo" -> null
      - target_resource_id             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-fe-00-demo-agw-pubsub" -> null
        # (3 unchanged attributes hidden)

      - enabled_log {
          - category       = "ApplicationGatewayAccessLog" -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - enabled_log {
          - category       = "ApplicationGatewayPerformanceLog" -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category       = "ApplicationGatewayAccessLog" -> null
          - enabled        = true -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayFirewallLog" -> null
          - enabled        = false -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category       = "ApplicationGatewayPerformanceLog" -> null
          - enabled        = true -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.pubsubappgateway[0].azurerm_public_ip.app_gw[0] will be destroyed
  # (because module.pubsubappgateway[0] is not in configuration)
  - resource "azurerm_public_ip" "app_gw" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-pubsub-fe-appgw-demo-pip" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "85.210.74.92" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "uksouth" -> null
      - name                    = "cft-pubsub-fe-appgw-demo-pip" -> null
      - resource_group_name     = "cft-demo-network-rg" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
          - "startupMode"  = "always"
        } -> null
      - zones                   = [
          - "1",
          - "2",
          - "3",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.pubsubappgateway[0].azurerm_web_application_firewall_policy.waf_policy[0] will be destroyed
  # (because module.pubsubappgateway[0] is not in configuration)
  - resource "azurerm_web_application_firewall_policy" "waf_policy" {
      - http_listener_ids   = [] -> null
      - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/pubsub-waf-policy-demo" -> null
      - location            = "uksouth" -> null
      - name                = "pubsub-waf-policy-demo" -> null
      - path_based_rule_ids = [] -> null
      - resource_group_name = "cft-demo-network-rg" -> null
      - tags                = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
          - "startupMode"  = "always"
        } -> null

      - managed_rules {
          - managed_rule_set {
              - type    = "OWASP" -> null
              - version = "3.2" -> null

              - rule_group_override {
                  - disabled_rules  = [] -> null
                  - rule_group_name = "REQUEST-920-PROTOCOL-ENFORCEMENT" -> null

                  - rule {
                      - action  = "Log" -> null
                      - enabled = true -> null
                      - id      = "920300" -> null
                    }
                  - rule {
                      - action  = "Block" -> null
                      - enabled = true -> null
                      - id      = "920440" -> null
                    }
                }
            }
        }

      - policy_settings {
          - enabled                          = true -> null
          - file_upload_limit_in_mb          = 100 -> null
          - max_request_body_size_in_kb      = 128 -> null
          - mode                             = "Prevention" -> null
          - request_body_check               = true -> null
          - request_body_inspect_limit_in_kb = 128 -> null
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2365,"Program":"tfcmt","SHA1":"","Target":"demo_pubsubappgateway - TerraformPlanApply","Vars":{}} -->